import {
  AcademicCapIcon,
  BanknotesIcon,
  BeakerIcon,
  ComputerDesktopIcon,
  RocketLaunchIcon,
  UserGroupIcon,
} from '@heroicons/react/24/outline';

const features = [
  {
    name: `ফ্রি এবং ওপেনসোর্স প্লাটফর্ম`,
    description: `আমাদের অনেকেরই প্রোগ্রামিং এবং ওয়েব ডেভেলপমেন্ট সেক্টরে ক্যারিয়ার গড়ার ইচ্ছা থাকলেও পূর্ণাঙ্গ গাইডলাইনের অভাবে আগাতে পারি না। ইউটিউবের শত শত ছন্নছাড়া ভিডিও টিউটোরিয়ালের ভিড়ে আমরা দিশেহারা। কি শিখবো, কতটুকু শিখবো, নতুন হিসাবে চাকরি পেতে ন্যূনতম কতটুকু দক্ষতা থাকা দরকার, এমন হাজারটা প্রশ্ন মাথায় ঘুরপাক খায়। তাই একেবারে জিরো থেকে পরিপূর্ণ এবং দক্ষ ডেভেলপার হওয়ার স্টেপ বাই স্টেপ গাইডলাইন প্রদানের জন্য 'কোডালয়' মাতৃভাষা বাংলায় বিনামূল্যে আমাদের একটি ক্ষুদ্র একটি প্রচেষ্টা।`,
    icon: BanknotesIcon,
  },
  {
    name: `হাতে কলমে শিক্ষা`,
    description: `প্রোগ্রামিং এবং ওয়েব ডেভেলপমেন্ট এর মতো বিষয়গুলো শুধুমাত্র পুঁথিগত বিদ্যা দিয়ে আয়ত্ত করা সম্ভব নয়। দক্ষ ডেভেলপার হওয়ার জন্য এই বিষয়গুলোর বাস্তব জগতে ব্যবহার হাতে কলমে শেখা ও বোঝা সবথেকে বেশি গুরুত্বপূর্ণ। তাই কোডালয়ের প্রতিটি কোর্সেই হাতে কলমে শেখার বিষয়টি সবথেকে বেশি গুরত্ব দেওয়া হয়েছে। প্রতিটা বিষয় শেখার আগে কেন আমাদের সেটা শেখা দরকার, কোথায় কাজে লাগবে, অন্য কোন বিকল্প সল্যুশন আছে কিনা, সবকিছু সম্পর্কেই পূর্ণ ধারণা পাওয়া যাবে।`,
    icon: BeakerIcon,
  },
  {
    name: `বাস্তবসম্মত প্রজেক্টস`,
    description: `ছোটবেলা থেকেই আমরা দেখে আসছি, পুঁথিগত বিদ্যা আর বাস্তব জীবনে কাজে লাগানোর মতো দক্ষতা, দুইটার ভিতরে অধিকাংশ সময়েই অনেকটা ব্যবধান থেকে যায়। এই ব্যবধান নিরসনে কোডালয়ের প্রতিটি কোর্সে বাস্তবসম্মত প্রোজেক্ট অন্তরভূক্ত করা হয়েছে। চাকরি জীবনে প্রতিদিন একজন ডেভলপারকে যেধরনের কাজ করতে হয়, সেগুলো সর্ম্পকে আগে থেকেই পরিপূর্ণ ধারণা দেবে এসব প্রজেক্ট। তাছাড়া চাকরির ইন্টারভিউয়ের সময় এসকল রিয়েল ওয়ার্ল্ড পোর্টফোলিও প্রোজেক্ট নতুনদের দক্ষতা উপস্থাপনেও সহায়তা করবে।`,
    icon: RocketLaunchIcon,
  },
  {
    name: `আধুনিক পাঠ্যসুচি`,
    description: `সফটওয়্যার ডেভেলপমেন্ট সেক্টর প্রতিনিয়ত পরিবর্তনশীল। প্রতিদিনই নতুন নতুন লাইব্রেরি, ফ্রেমওয়ার্ক আর টেকনলজির আবির্ভাব হচ্ছে। কিন্তু সেই পরিবর্তনের সাথে তাল মিলিয়ে অধিকাংশ টিউটোরিয়াল কনটেন্টগুলো আপডেট হয় না। আর ইউটিউবের ভিডিও টিউটোরিয়ালগুলোর ক্ষেত্রে এই সমস্যা আরও প্রকট। সমাধান আমাদের কোডালয়ের ওপেনসোর্স ভিত্তিক আধুনিক পাঠ্যসূচি ও কোর্স কারিকুলম। সম্পূর্ণ ওপেনসোর্স হওয়ায় সকলেই কনটেন্টগুলোর পরিবর্তন, পরিবর্ধন এবং ভুল সংশোধনে অবদান রাখতে পরে।
    `,
    icon: AcademicCapIcon,
  },
  {
    name: `লোকাল সেটআপের ঝামেলামুক্ত`,
    description: `কোনকিছু নতুন বা প্রথমবারের মতো শেখা এমনিতেই বেশ কঠিন একটা ব্যাপার। তার উপর প্রোগ্রামিং শেখার শুরুতেই লোকাল কম্পিউটার বা ল্যাপটপে একগাদা সফটওয়্যার, লাইব্রেরি, টুলস ইত্যাদি ইনস্টল করতে হয়। আবার অনেক সময় টিউটোরিয়ালে দেখানো পদ্ধতিতে আমাদের লোকাল মেশিনে ঠিকভাবে সবকিছু ইনস্টল হয় না। নতুনদের জন্য সেটা মরার উপর খাড়ার ঘায়ের মতো। কোডালয় ইন্টারঅ্যাকটিভ ক্লাউড এডিটর এনভায়রনমেন্ট দিবে শেখার শুরুতেই এসকল অনাকাঙ্খিত ঝামেলা থেকে মুক্তি।`,
    icon: ComputerDesktopIcon,
  },
  {
    name: `সকলের তরে সকলে আমরা`,
    description: `কোডালয়ের মিশন হচ্ছে বাংলা ভাষাভাষী শিক্ষার্থীদের জন্য সফটওয়্যার ডেভেলপমেন্ট ইন্ডাস্ট্রিতে প্রবেশপথ সহজ ও সুগম করা। বিশেষ করে নতুনদের জন্য ভাষা যেন প্রতিবন্ধক না হয়। কেউ যেন আগ্রহ থাকা সত্ত্বেও পূর্ণাঙ্গ গাইডলাইনের অভাবে ঝরে না পড়ে। আর এই মিশন সফল করতে সমমনা মানুষগুলোকে একই কমিউনিটি প্লাটফরমের নিচে আনার একটি প্রচেষ্টা কোডালয়, যেখানে তারা পরস্পরকে উৎসাহ দিবে, সহযোগিতা করবে, মোটিভেশনাল রাখবে, সর্বোপরি পুরো জার্নিটাকে আনন্দময় করে তুলবে।`,
    icon: UserGroupIcon,
  },
];

export const FeatureGrid = () => {
  return (
    <div className="relative py-16 sm:py-24 lg:py-32">
      <div className="mx-auto max-w-md px-4 text-center sm:max-w-3xl sm:px-6 lg:max-w-7xl lg:px-8">
        <h2 className="text-base font-semibold uppercase tracking-wider text-indigo-600">
          বৈশিষ্টসমূহ
        </h2>
        <p className="mt-2 text-3xl font-extrabold tracking-tight text-slate-900 dark:text-white sm:text-4xl">
          প্রোগ্রামিং ক্যারিয়ার গঠনের পূর্ণাঙ্গ গাইডলাইন
        </p>
        <p className="mx-auto mt-5 max-w-prose text-xl text-slate-600 dark:text-slate-400">
          সবচেয়ে কম সময়ে প্রোগ্রামিং এবং ওয়েব ডেভেলপমেন্ট শিখুন, কোন রকম লোকাল
          সেটআপ বা ভিডিও টিউটোরিয়ালের ঝামেলা ছাড়া
        </p>
        <div className="mt-12">
          <div className="grid grid-cols-1 gap-8 sm:grid-cols-2 lg:grid-cols-3">
            {features.map((feature) => (
              <div key={feature.name} className="pt-6">
                <div className="dark:highlight-white/5 flow-root rounded-lg bg-slate-100 px-6 pb-8  dark:bg-slate-800">
                  <div className="-mt-6">
                    <div>
                      <span className="inline-flex items-center justify-center rounded-md bg-indigo-500 p-3 shadow-lg">
                        <feature.icon
                          className="h-6 w-6 text-white"
                          aria-hidden="true"
                        />
                      </span>
                    </div>
                    <h3 className="mt-8 text-lg font-medium tracking-tight text-slate-900 dark:text-slate-300">
                      {feature.name}
                    </h3>
                    <p className="mt-5 text-center text-base text-slate-600 dark:text-slate-400">
                      {feature.description}
                    </p>
                  </div>
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
};
